snappyHexa meshing/snappyHexMesh_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    topPatch
    {
        type            patch;
        nFaces          9040;
        startFace       2055122;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          175441;
        startFace       2064162;
    }
    bottomPatch
    {
        type            patch;
        nFaces          9040;
        startFace       2239603;
    }
)

// ************************************************************************* //
